<?php

return [
    'plural' => 'الحجوزات',
    'singular' => 'الحجز',
    'empty' => 'لا توجد حجوزات',
    'select' => 'اختر الحجز',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'list' => 'كل الحجوزات',
        'show' => 'عرض',
        'create' => 'إضافة حجز جديدة',
        'new' => 'إضافة',
        'edit' => 'تعديل  الحجز',
        'delete' => 'حذف الحجز',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'favorites' => [
        'list' => 'كل المفضله',
        'created_at' => 'تاريخ الاضافه للمفضله',
        'empty' => 'لا يوجد مفضله',
    ],
    'messages' => [
        'created' => 'تم إضافة الحجز بنجاح .',
        'updated' => 'تم تعديل الحجز بنجاح .',
        'deleted' => 'تم حذف الحجز بنجاح .',
        'not_available_seats' => 'لا يوجد اماكن فارغه في الرحلة',
        'check_route' => 'تأكد من ترتيب المحطات'
    ],
    'attributes' => [
        'bus_id' => 'الباص',
        'seat_id' => 'الكرسي',
        'start_id' => 'محطة الإنطلاق',
        'end_id' => 'محطة النزول',
        'customer_id' => 'العميل',
        'created_at' => 'تاريخ الحجز',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه الحجز ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
];
