<?php

return [
    'plural' => 'العملاء',
    'singular' => 'العميل',
    'empty' => 'لا توجد عملاء',
    'select' => 'اختر العميل',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'list' => 'كل العملاء',
        'show' => 'عرض',
        'create' => 'إضافة عميل جديد',
        'new' => 'إضافة',
        'edit' => 'تعديل  العميل',
        'delete' => 'حذف العميل',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'favorites' => [
        'list' => 'كل المفضله',
        'created_at' => 'تاريخ الاضافه للمفضله',
        'empty' => 'لا يوجد مفضله',
    ],
    'messages' => [
        'created' => 'تم إضافة العميل بنجاح .',
        'updated' => 'تم تعديل العميل بنجاح .',
        'deleted' => 'تم حذف العميل بنجاح .',
    ],
    'attributes' => [
        'name' => 'اسم العميل',
        'phone' => 'رقم الهاتف',
        'email' => 'البريد الالكترونى',
        'created_at' => 'تاريخ الإنضمام',
        'old_password' => 'كلمة المرور القديمة',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'type' => 'نوع المستخدم',
        'avatar' => 'الصورة الشخصية',
        'country' => 'البلد',
        'city' => 'المدينه',
        'area' => 'المنطقه',
        'show_email' => 'اظهار الإيميل',
        'show_phone' => 'اظهار رقم الهاتف',
        'active_chat' => 'تفعيل الشات',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا العميل ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
];
