<?php

return [
    'plural' => 'المحطات',
    'singular' => 'المحطة',
    'empty' => 'لا توجد محطات',
    'select' => 'اختر المحطة',
    'perPage' => 'عدد النتائج في الصفحة',
    'actions' => [
        'list' => 'كل المحطات',
        'show' => 'عرض',
        'create' => 'إضافة محطة جديد',
        'new' => 'إضافة',
        'edit' => 'تعديل  المحطة',
        'delete' => 'حذف المحطة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'favorites' => [
        'list' => 'كل المفضله',
        'created_at' => 'تاريخ الاضافه للمفضله',
        'empty' => 'لا يوجد مفضله',
    ],
    'messages' => [
        'created' => 'تم إضافة المحطة بنجاح .',
        'updated' => 'تم تعديل المحطة بنجاح .',
        'deleted' => 'تم حذف المحطة بنجاح .',
    ],
    'attributes' => [
        'name' => 'اسم المحطة',
        '%name%' => 'اسم المحطة',
        'created_at' => 'تم إنشاءه بتاريخ'
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا المحطة ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
];
