<?php

return [
    'plural' => 'محطات التوقف',
    'singular' => 'محطة التوقف',
    'empty' => 'لا توجد محطات توقف',
    'select' => 'اختر محطة التوقف',
    'perPage' => 'عدد النتائج في الصفحة',
    'last_station' => 'آخر محطة',
    'first_station' => 'المحطة الأولي',
    'actions' => [
        'list' => 'كل محطات التوقف',
        'show' => 'عرض',
        'create' => 'إضافة محطة توقف جديدة',
        'new' => 'إضافة',
        'edit' => 'تعديل  محطة التوقف',
        'delete' => 'حذف محطة التوقف',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'favorites' => [
        'list' => 'كل المفضله',
        'created_at' => 'تاريخ الاضافه للمفضله',
        'empty' => 'لا يوجد مفضله',
    ],
    'messages' => [
        'created' => 'تم إضافة محطة التوقف بنجاح .',
        'updated' => 'تم تعديل محطة التوقف بنجاح .',
        'deleted' => 'تم حذف محطة التوقف بنجاح .',
    ],
    'attributes' => [
        'trip_id' => 'الرحلة',
        'station_id' => 'المحطة',
        'order' => 'ترتيب المحطة في الرحلة'
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف محطة التوقف ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
];
